examples/dot/complex_chain.dot
strict digraph "" {
    node [label="\N"];
    "Frame1" [label="Frame", shape=box];
    "Interval1" [label="50 ns", shape=box];
    "Waveform1" [label="ConstantWaveform", shape=box];
    "Waveform1" -> "Interval1"  [label="Duration", style=dashed];
    "Instruction2" [label="ModulatedPulse", shape=box];
    "Instruction2" -> "Frame1"  [label="Frame", style=dashed];
    "Instruction2" -> "Waveform1"  [label="Envelope", style=dashed];
    "Radians2" [label="1 rad", shape=box];
    "Instruction2" -> "Radians2"  [label="PhaseOffset", style=dashed];
    "Instruction5" [label="ModulatedPulse", shape=box];
    "Instruction5" -> "Frame1"  [label="Frame", style=dashed];
    "Instruction5" -> "Waveform1"  [label="Envelope", style=dashed];
    "Radians3" [label="2 rad", shape=box];
    "Instruction5" -> "Radians3"  [label="PhaseOffset", style=dashed];
    "Frame2" [label="Frame", shape=box];
    "Instruction6" [label="ModulatedPulse", shape=box];
    "Instruction6" -> "Frame2"  [label="Frame", style=dashed];
    "Instruction6" -> "Waveform1"  [label="Envelope", style=dashed];
    "Radians4" [label="3 rad", shape=box];
    "Instruction6" -> "Radians4"  [label="PhaseOffset", style=dashed];
    "Instruction7:Alignment" [label="StartToStart", shape=box];
    "Instruction7:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction7:Relationship" -> "Instruction7:Alignment"  [label="Alignment", style=dashed];
    "Instruction7" [label="Dependency", shape=box];
    "Instruction7" -> "Instruction7:Relationship"  [label="Relationship", style=dashed];
    "Instruction7" -> "Instruction5"  [label="Lhs", style=dashed];
    "Instruction7" -> "Instruction6"  [label="Rhs", style=dashed];
    "Instruction8" [label="ModulatedPulse", shape=box];
    "Instruction8" -> "Frame1"  [label="Frame", style=dashed];
    "Instruction8" -> "Waveform1"  [label="Envelope", style=dashed];
    "Radians5" [label="4 rad", shape=box];
    "Instruction8" -> "Radians5"  [label="PhaseOffset", style=dashed];
    "Instruction9:Alignment" [label="EndToStart", shape=box];
    "Instruction9:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction9:Relationship" -> "Instruction9:Alignment"  [label="Alignment", style=dashed];
    "Instruction9" [label="Dependency", shape=box];
    "Instruction9" -> "Instruction9:Relationship"  [label="Relationship", style=dashed];
    "Instruction9" -> "Instruction7"  [label="Lhs", style=dashed];
    "Instruction9" -> "Instruction8"  [label="Rhs", style=dashed];
    "Instruction10:Alignment" [label="EndToStart", shape=box];
    "Instruction10:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction10:Relationship" -> "Instruction10:Alignment"  [label="Alignment", style=dashed];
    "Instruction10" [label="Dependency", shape=box];
    "Instruction10" -> "Instruction10:Relationship"  [label="Relationship", style=dashed];
    "Instruction10" -> "Instruction2"  [label="Lhs", style=dashed];
    "Instruction10" -> "Instruction9"  [label="Rhs", style=dashed];
}
